Revit 2027 API
OptionalFunctionalityUtils.Is3DMImportLinkAvailable Method
 Checks whether the 3DM Import/Link functionality is available in the installed Revit.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool Is3DMImportLinkAvailable()
Public Shared Function Is3DMImportLinkAvailable As Boolean
public:
static bool Is3DMImportLinkAvailable()
static member Is3DMImportLinkAvailable : unit -> bool
Return Value
Boolean
 True if the 3DM Import/Link functionality is available in the installed Revit.
Remarks
 3DM Import/Link is optional functionality that does not have to be part of the Revit installation.
See Also
Reference
OptionalFunctionalityUtils Class
Autodesk.Revit.DB Namespace